{"page_title":"DiQi System","toptext":"<p>DiQi is an open protocol and platform that makes financial market more transparent.  DiQi network can be inspected and verified by all participating users. Traditional financial instruments can be brought onto DiQi platform, doing away the need for intermediary parties and the associated inconveniences and dangers. DiQi has improved the Bitcoin blockchain technology and transformed it into a transaction platform with greater capacity for expansion and higher transaction frequency.</p> <p>Our goal is to use blockchain technology to construct a comprehensive state-of-the-art peer-to-peer financial transaction platform.</p>\n","sections":[{"content":"<p>Similar to Bitcoin, DiQi employs distributed ledger system called “blockchain”.  All verified transactions are placed on blockchain.  The transactions are verified by all network participants.   A process called “mining” is used to verify the transaction, maintain transaction chronological orders, and achieve consensus among decentralized network participants.</p>\n","image":"l1","ref":"features","heading":"A secure distributed platform"},{"content":"<p>DiQi is a multi-currency network.  Bitcoin is a single-currency network.  DiQi natively supports multiple currencies.  DiQi currency issuers have to obtain a coin-minting license to issue the currency.  A user may need to register with an issuer to use that issuer’s currency.</p>\n","image":"l2","ref":"features","heading":"Multiple electronic currencies"},{"content":"<p>One of the limitations of Bitcoin is its fairly low transactions per second (TPS).  Currently, Bitcoin network can only handle an average transaction volume of 7 TPS.  DiQi network addressed this challenge by having shorter block time.  On average, at peak transaction times, DiQi network generates a transaction block every 15 seconds.  The DiQi network has been specifically designed to satisfy financial applications.  It has substantially increased its transaction frequency capacity and substantially shortened transaction confirmation time.</p>\n","image":"l3","ref":"consensus_algorithm","heading":"Supports high-frequency transactions"},{"content":"<p>The DiQi network improves upon Bitcoin’s proof of work algorithm with the alliance-based CPOW (Consortium proof of work) algorithm.  Combind with dynamic mining difficulty improvement, DiQi is able to avoid the famous “51% attack” vulnerability in Bitcoin network.</p>\n","image":"l4","ref":"alliance","heading":"A more secure algorithm"},{"content":"<p>Participants taking on different roles to maintain the platform’s functional integrity. Multiple alliance members take on the responsibility of generating blocks. These blocks provide historical transaction information. Alliance member nodes also inspect and verify network transactions.</p> <p>Issuers have coin-minting certificates that can issue a DiQi currency. Users (DiQi Wallet) need to register with individual issuer to use that issuer’s currency.</p> <p>Users can obtain currency from an issuer or another user. (see DiQi White paper)</p>\n","image":"l5","ref":"issuer","heading":"Multi-centered decentralized structure"}],"common":{"navbar":{"heading":"Navigation","links":[{"href":"/learn/","title":"Learn"},{"href":"/wallet/","title":"Wallet"},{"href":"/about/","title":"About Us"},{"href":"http://blog.diqi.us/","title":"Blog"}]},"main_title":"DiQi","language":{"page_language":"en-us"},"footer":{"copyright":"Copyright © DiQi.us 2015","heading":"Related links","links":[{"href":"/","title":"Home"},{"href":"/learn","title":"Learn"},{"href":"/wallet","title":"Wallet"},{"href":"/about","title":"About Us"},{"href":"http://blog.diqi.us","title":"Blog"},{"href":"/static/whitepaper_en.pdf","title":"Whitepaper"},{"href":"/eula","title":"EULA"}]}},"heading":"DiQi SYSTEM"}